// - 개발자도구(F12) [console]탭 출력 함수 , console.log()
// - HTML에서 알람창으로 input[입력] 함수 , prompt() , Number( prompt() ) 
//      - HTML 알람창에서 입력받은 (문자-String)값 반환 함수
//      - 숫자 입력받기 : Number( prompt() ) 

/*
    연산자 : 연산 할 때 사용되는 기호
        1. 산술연산자 : 결과 --> 하나의 연산결과를 값으로 반환
            + 더하기 , - 빼기 , * 곱하기 , / 나누기 , % 나머지 , parseInt( ) 정수변환 함수 
        2. 연결연산자
            + 연결
        3. 비교연산자 : 결과 --> 하나의 연산결과를 (논리-참true / 거짓false) 값으로 반환
            >초과/크다
            >= 이상/크거나 같다
            <미만/작다
            <= 이하/작거나 같다
            ==같다(값) , ===같다(값과타입)     10 == "10" true , 10 === "10" false
            !=같지않다(값) , !===같지않다(값과타입)
               

        4. 관계연산자 : 결과 --> 하나의 연산결과를 (논리-참true / 거짓false) 값으로 반환,
          && 이면서 면서 이고 그리고 모두 and조건 ,  초등학생이 사탕 이면서 초콜릿 먹겠다.
          || 이거나 거나 하나라도 또는 or조건  , 초등학생이 사탕 또는 초콜릿 먹겠다.
          ! 부정 반대 not조건 , !ture -- > false , !false --> true



        5. 대입연산자
        6. 증감연산자
        7. 삼항연산자
    
    문자열 타입 ---> 숫자 타입 변환하는 방법  , 문자"10" -> 숫자10 으로 변환  
        1. 곱셈연산 이용한 방법 
            "10"*1  ==> 10 
        2. 숫자로 변환 함수 Number( )
            Number( "10" )  ==> 10
    숫자 타입 ---> 문자열 변환 방법
        1. 연결연산 이용한 방법 , 숫자 10 -> 문자 "10" 으로 변환 
            10 + '' ==> '10'
        2. 문자로 변환 함수 String( )
            String( 10 ) ==> "10"

    * 타입 변환이 필요한 이유?? 프론트엔드(HTML/CSS/JS) <--- 통신(HTTP) ---> 백엔드(JAVA/DB)
    * 다형성 : 다양한 형태를 가지는 성질 , 데이터가 타입이 변환이 된다.

// [2] 비교연산자
