let 카테고리목록 =[
    {카테고리번호 : 1 , 카테고리명 : "해외축구"}
    {카테고리번호 : 2 , 카테고리명 : "비트코인"}
    ]
    
    #(2)
    let 게시물 목록 =[
    { 게시물 번호 : 1 , 제목 : "안녕하세요" , 글쓴이 : "유느" , 작성일 : 12-02 , 조회수 : 1 , 내용 : "황유" , 비밀번호 : 1234 , 카테고리 번호 : 1 }
    { 게시물 번호 : 1 , 제목 : "비트간다~~~" , 글쓴이 : "우지한" , 작성일 : 12-02 , 조회수 : 1 , 내용 : "하락다이버전슼ㅋㅋ" , 비밀번호 : 1234 , 카테고리 번호 : 2}
    { 게시물 번호 : 1 , 제목 : "안녕하세요" , 글쓴이 : "유느" , 작성일 : 12-02 , 조회수 : 1 , 내용 : "황유" , 비밀번호 : 1234 , 카테고리 번호 : 1 }
    { 게시물 번호 : 1 , 제목 : "안녕하세요" , 글쓴이 : "우지한" , 작성일 : 12-02 , 조회수 : 1 , 내용 : "하락다이버전슼ㅋㅋ" , 비밀번호 : 1234 , 카테고리 번호 : 2 }
     ]
    
     #(3)
     let 
    { 댓글 번호 : 1 , 비밀번호 :5678 , 내용 : "황유" , 게시물번호 : 1 }
    { 댓글 번호 : 1 , 비밀번호 :5678 , 내용 : "하락다이버전슼ㅋㅋ" , 게시물번호 : 2 }
    { 댓글 번호 : 1 , 비밀번호 :5678 , 내용 : "황유" , 게시물번호 : 3 }
    { 댓글 번호 : 1 , 비밀번호 :5678 , 내용 : "하락다이버전슼ㅋㅋ" , 게시물번호 : 4 }
    -->