/*
# 권장순서
# 1. 저장할 데이터들을 수집 ,  시장조사 , 기획
     - 갤러리명 , 게시물제목 , 글쓴이 , 작성일 , 조회 , 게시물내용 , 게시물 비밀번호 , 댓글 비밀번호 , 댓글내용 , 갤러리 번호부여
      해외축구   안녕하세요    유느    12월02일  1       황유        1234             5678         황유            1
                                                                                    1234         황유               1
      비트코인   비트간다~~~   우지한   12월02일  3    하락다이버전슼ㅋㅋ 1234                                      2
                                                                                  5678          ㅇㅇ                2
# 2. 중복을 최소화할 수 있는 데이터들을 관계별 분류
     - 갤러리끼리 / 게시물끼리 / 댓글끼리         / 작성일자끼리 / 
       해외축구    안녕하세요    황유
       비트코인    비트간다~~~   하락다이버전슼ㅋㅋ
                                황유
                                ㅇㅇ
# 3. 분류한 데이터들을 관계 연결 # 상하관계 # 식별자 연결 (중복의 최소화,식별자 사용필요)
     - 갤러리(상위) --- 게시물(하위) / - 게시물(상위) --- 댓글(하위)
     
    갤러리 1번 해외축구 -- 갤러리 고유 번호 부여 1 -- 게시물 갤러리 번호 - 
    갤러리 2번 비트코인 -- 갤러리 고유 번호 부여 2
# 4.JS 데이블(표) = 배열 , 행/가로 = 객체



[1] HTML 작성 
    [2] 구현할 페이지 메모리 구성 
        - 제목 , 내용 , 비밀번호 , 작성일 , 조회수 필드/속성 값을 기록/저장 
        방법1] 각 속성별 배열 선언한다.
        let 영화관전체지역선택 = [ '서울' , '경기/인천' , '충청/대전', ]
        let 영화관인천/경기지역목록 = [  '부평갈산' , '부평' , '부평역사' ]
        let 부평갈산 영화목록 = [ '위키드' , '소방관' , '히든페이스']
        let 영화상영선택 =['위키드']
        let 영화상영일자시간 = [ 2024-12-03 , 2024-12-04 , 2024-12-05 ]
        let 영화상영관선택및시간 =['7관',13:15,16:30,19:40 , '5관',14:40,17:50]
        let 상영시간선택 = [ 13:15 ]
        let 상영좌석선택 = [ '3' , '2' , '0' ]





        "#(1)
 let 카테고리목록 = [
  { 카테고리번호 : 1 , 카테고리명 : ""해외축구"" },
  { 카테고리번호 : 2 , 카테고리명 : ""비트코인"" }
 ]
 
 #(2)
 let 게시물목록 = [
  { 게시물번호 : 1 , 제목 : ""안녕하세요1"" , 글쓴이 : ""유재석1"" , 작성일 : ""12-01"" , 조회수 : 3 , 내용 : 하하하하 , 비밀번호 : 1234 , 카테고리번호 : 1 },
 
  { 게시물번호 : 2 , 제목 : ""안녕하세요2"" , 글쓴이 : ""유재석2"" , 작성일 : ""12-02"" , 조회수 : 3 , 내용 : 하하하하 , 비밀번호 : 1234 , 카테고리번호 : 2 },
 
  { 게시물번호 : 3 , 제목 : ""안녕하세요3"" , 글쓴이 : ""유재석3"" , 작성일 : ""12-03"" , 조회수 : 3 , 내용 : 하하하하 , 비밀번호 : 1234 , 카테고리번호 : 1 },
 
  { 게시물번호 : 4 , 제목 : ""안녕하세요4"" , 글쓴이 : ""유재석4"" , 작성일 : ""12-04"" , 조회수 : 3 , 내용 : 하하하하 , 비밀번호 : 1234 , 카테고리번호 : 1 }
 ]
 
 #(3)
 let 댓글목록 = [
  { 댓글번호 : 1 , 비밀번호 : 1234 , 내용 : ""그래안녕1"" , 게시물번호 : 1 },
  { 댓글번호 : 2 , 비밀번호 : 1234 , 내용 : ""그래안녕2"" , 게시물번호 : 1 },
  { 댓글번호 : 3 , 비밀번호 : 1234 , 내용 : ""그래안녕3"" , 게시물번호 : 3 },
  { 댓글번호 : 4 , 비밀번호 : 1234 , 내용 : ""익명의회색곰"" , 게시물번호 : 4 }
 ]
"										
										
						
*/



/*
각 속성별 배열 선언한다.
#(1)
 let 영화관전체목록 = [
  { 카테고리지역고유번호 : 1 , 카테고리명 : "서울" },
  { 카테고리지역고유번호 : 2 , 카테고리명 : "경기/인천" }
  { 카테고리지역고유번호 : 3 , 카테고리명 : "충청/대전" }]
 
 #(2)
 let 영화관목록목록 = [
  { 인천/경기: 2-1 , 지점 : "부평역사" , 카테고리지역고유번호 : 2 },
 
  { 인천/경기 : 2 -2, 지점 : "부평갈산" , , 카테고리지역고유번호 : 2 },
 
  { 인천/경기 : 2 -3, 지점 : "부평" ,  카테고리지역고유번호 : 2 },
 
 ]
 
 #(3)
 let 영화목록 = [
  { 영화상영번호 : 2-2-2-1 , 비밀번호 : 1234 , 제목 : "위키드" , 게시물번호 : 1 },
  { 영화상영번호 : 2-2--2-2 , 비밀번호 : 1234 , 제목 : "소방관" , 게시물번호 : 2 },
  { 영화상영번호 : 2-2-2-3 , 비밀번호 : 1234 , 제목 : "히든페이스" , 게시물번호 : 3 },

 #(4)
 let 상영일자목록 = [
  { 2-2-2-1 , 2024-12-03 , 2024-12-04 , 2024-12-05 }
 ]


 #(5)
 let 상영관선택및시간[
 { 2-2-2-1 , '7M' , 13:15 , 16:30 , 19:40 }
 { 2-2-2-1 , '5M' , 14:40 , 17:50 }
 ]
 

 #(6)
 let 상영시간선택및좌석선택
 { 2-2-2-1 , 7M , T1 }
 
 ]
       