/* [컨셉2]               
OOO 수강생 관리            수강생을 어떻게 클래스로 등록하느냐고 관건   
   [ 필수 요구사항 ]            
   - 클래스 기능   - 클래스 등록   , 정보는 3개이상으로 임의 구성합니다.      
      - 클래스 전체 출력         
      - 클래스 정보 수정         
      - 클래스 삭제         
               
   - 수강생 기능   - 수강생 등록   , 정보는 3개이상으로 임의 구성합니다.      
      - 수강생 전체 출력         
      - 수강생 정보 수정         
      - 수강생 삭제         
               
   ++ (수강 등록 기능 ) 각 수강생을 특정 클래스에 배정 합니다.            
   ++ 적당한 CSS 합니다   


[개발순서]
        1. HTML : 프론트엔드 와이어프레임/프로토타입 구성
        2. JS : 그 구성된 화면과 요구사항에서 필요한 메모리/데이터 구성
        3. JS : 요구사항에 따라 구현할 기능/함수 구성 , 함수별 비지니스로직 구성
        4. HTML/JS 연동 
        5. 테스트
        6. 유지보수


// 클래스 관리 - 수강생 정보 - 클래스 배정 - 수강생 



/*
각 속성별 배열 선언한다.
#(1)
 let 클래스코드 = [
   { 클래스코드 : 1 , 클래스명 : "HTML" , 클래스담당자 : "홍길동" , 클래스시작일자 : 12-04 },
   { 클래스코드 : 2 , 클래스명 : "CSS" , 클래스담당자 : "길홍동" , 클래스시작일자 : 12-05 },
   { 클래스코드 : 3 , 클래스명 : "JS" , 클래스담당자 : "동길홍" , 클래스시작일자 : 12-06 }
   ]

#(2)
 let 수강생코드 = [
   { 수강생코드 : 1 , 성명 : "강아지" , 연락처 : 123-4567-8888 , 클래스시작일자 : 12-04 , 클래스코드 : 1 },
   { 수강생코드 : 2 , 성명 : "아강지" , 연락처 : 123-4567-9999 , 클래스시작일자 : 12-05 , 클래스코드 : 2 },
   { 수강생코드 : 3 , 성명 : "지아강" , 연락처 : 123-4567-4444 , 클래스시작일자 : 12-06 , 클래스코드 : 3 }
   ]

 */
               


   #(1)
   let 클래스코드 = [
     { 클래스코드 : 1 , 클래스명 : "HTML" , 클래스담당자 : "홍길동" , 클래스시작일자 : 12-04 },
     { 클래스코드 : 2 , 클래스명 : "CSS" , 클래스담당자 : "길홍동" , 클래스시작일자 : 12-05 },
     { 클래스코드 : 3 , 클래스명 : "JS" , 클래스담당자 : "동길홍" , 클래스시작일자 : 12-06 }
     ]
  
  #(2)
   let 수강생코드 = [
     { 수강생코드 : 1 , 성명 : "강아지" , 연락처 : 123-4567-8888 , 클래스시작일자 : 12-04 , 클래스코드 : 1 },
     { 수강생코드 : 2 , 성명 : "아강지" , 연락처 : 123-4567-9999 , 클래스시작일자 : 12-05 , 클래스코드 : 2 },
     { 수강생코드 : 3 , 성명 : "지아강" , 연락처 : 123-4567-4444 , 클래스시작일자 : 12-06 , 클래스코드 : 3 }
     ]
  

    클래스코드 등록함수 출력함수 수정함수 삭제함수
    수강생코드 등록함수 출력함수 수정함수 삭제함수 

    만들어주세요.

     // 클래스 등록함수
function goBtn1(){
    document.querySelector(.)
} // f end

// 수강생 등록함수
function goBtn2(){

} // f end

// 출력함수
function Print(){

} // f end

// 삭제함수
function byeBtn(){

} // f end

// 수정함수
function whatBtn(){

} // f end