/*
     -타입
       - 각 프로그래밍 언어들이 데이터들을 분류 하는 것 (예] 분리수거)
       - 페트병인지? 종이류 인지? 유리 인지? 병 인지?
       - 문자인지? " ", ' ', ``,
       - 불리언인지? true, false
       - 숫자인지? 154, 3.15, 747
       - 배열인지? [ ]
  
     -배열
          -나열 :  열거 하기 위해 하나씩 줄 세우는 것
          -열거 : 여러가지를 낱낱이 늘어놓음
             1.배열이란 ? 순서대로 번호가 붙인 원스 들이 연속적인 형태로 구성된 *타입*
             2.인데스이란 ? 순서대로 배정된 번호, 0번 시작, 길이/총개수 : 3 / 인덱스 0 1 2
             3.배열선언 : [ ] 대괄호
                 let 변수명 = [ 값1,값2,값3], [ ]대괄호 안에서, (쉼표)를 이용한 값을 구분하여 열거한다.
             4.배열전체 호출  : 
                 변수명
             5.배열 내 특정한 위치의 요소(값) 호출
                 변수명[인덱스] 
             6.배열수정(배열 내 특정한 위치의 요소(값) 수정)
                 1.전체 수정
                     배열변수명 = [ 새로운 배열 ]
                 2.특정한 위치의 요소(값) 수정
                     배열변수명[ 인덱스 ] = 새로운 값
            7.배열 내 (마지막 인덱스) 새로운 값 추가
                 배열변수명.push( 새로운 값 )

*/

// * 개발자 도구의 크롬브라우저 12F 키 에서 데이터 출력 할 때 사용하는 함수. console.log()

// [1] 배열변수 선언
let pointArray = [ 100 , 50 , 30 ]

// [1] 배열변수 값들을 호출
pointArray // 변수의 값을 호출만
console.log( pointArray ) // 변수의 값을 호출해서 개발자도구에 출력

// [3] 배열변수의 특정한 위치의 요소(값) 호출
console.log( pointArray[0] ) // 0번 인덱스의 존재하는 데이터 가 반환 // 100
console.log( pointArray[1] ) // 1번 인덱스의 존재하는 데이터 가 반환 // 50
console.log( pointArray[2] ) // 2번 인덱스의 존재하는 데이터 가 반환 // 30

// [생각해보기] :  변수 몇개??, 리터링 몇개??, 타입 몇개??, 변수는 몇개 저장하고 있을까요?
// 결과 보다 과정이 중요합니다.
// [확인] 변수:pointArray, 리터럴:100/50/30, 숫자타입/배열타입, 배열1개.
// * 변수는 여러개의 데이터를 갖는 배열타입 1개 저장 * 변수는 무조건X6 1개의 데이터만 저장 가능.
// 예] 쇼핑 > 음료1개,과자1개,신발,1개,의류1개 == 데이터 4개
// --- 쇼핑백 1개에 구매한것들을 담아 == 쇼핑백(음료1개,과자1개,신발1개,의류1개)
// --- 쇼핑백은 1개고, 쇼핑백안에 있는 구매품은 4개

let 유재석 = [ '정준하' , '박명수' , '하하' , '노홍철' ] //쇼핑백
// --- 유재석은 쇼핑백;배열 ---> 배열은 각 리터럴들을 참조

//[4] 배열변수의 배열 전체 수정
console.log( pointArray )               // [100, 50, 30]
pointArray = [ '유재석' ,'강호동']       
console.log( pointArray )               // ['유재석' , '강호동']
//[4-2] 배열변수의 특정 위치 요소(값) 수정
pointArray[0] = '신동엽'  // 0번째 위치에 값을 '유재석' ---> '강호동'변경/수정
console.log( pointArray )              // ['신동엽' , '강호동' ]
// [생각해보기] : 만약에 배열변수가 [ '유재석' , '강호동' ] 수정/변경 되면 기존[100, 50, 30] 은 어떻게 될까??
// ---> 100 , 50 , 30 => 각 리터럴/데이터 3개    /    [ 100 , 50 , 30 ] => 3개의 데이터를 갖는/참조 배열 1개
// ---> 즉] 배열은 사라지지만, 리터럴은 사라지지 않는다.

// [5] 배열변수의 데이터 추가/삽입 (쇼핑백에 새로운것을 추가/삽입)
pointArray.push( '서장훈' ) // [ '신동엽' , '강호동' ] ---> push('서장훈')
console.log( pointArray ) // [ '신동엽' , '강호동' , '서장훈' ]